jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F0xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32F042K6'  ***************************** -->
        <device Dname="STM32F042K6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="28"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="QFP"           n="32"/>
        </device>

        <!-- *************************  Device 'STM32F042T4'  ***************************** -->
        <device Dname="STM32F042T4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="30"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="CSP"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32F042T6'  ***************************** -->
        <device Dname="STM32F042T6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="30"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="CSP"           n="36"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F048'  **************************** -->
      <subFamily DsubFamily="STM32F048">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h" define="STM32F042"/>
        <debug svd="SVD\STM32F042x.svd"/>
        <book name="Documents\DM00031936.pdf" title="STM32F048 Series Reference Manual"/>
        <book name="Documents\DM00109264.pdf" title="STM32F048 Data Sheet"/>

        <feature type="DMA"           n="5"/>
        <feature type="Timer"         n="5"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="I2S"           n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="1"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F048C6'  ***************************** -->
        <device Dname="STM32F048C6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="38"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32F048G6'  ***************************** -->
        <device Dname="STM32F048G6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="24"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="QFP"           n="28"/>
        </device>

        <!-- *************************  Device 'STM32F048T6'  ***************************** -->
        <device Dname="STM32F048T6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="30"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="CSP"           n="36"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F051'  **************************** -->
      <subFamily DsubFamily="STM32F051">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h" define="STM32F051"/>
        <debug svd="SVD\STM32F0xx.svd"/>
        <book name="Documents\DM00031936.pdf" title="STM32F051 Series Reference Manual"/>
        <book name="Documents\DM00039193.pdf" title="STM32F051 Data Sheet"/>

        <feature type="Timer"         n="7"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F051C4'  ***************************** -->
        <device Dname="STM32F051C4">
          <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="6000000"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32F051C6'  ***************************** -->
        <device Dname="STM32F051C6">
          <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"       m="6000000"/>
          <feature type="QFP"           n="48"/>
        </device>

