jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F0xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32F072RB'  ***************************** -->
        <device Dname="STM32F072RB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F072V8'  ***************************** -->
        <device Dname="STM32F072V8">
          <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
        </device>

        <!-- *************************  Device 'STM32F072VB'  ***************************** -->
        <device Dname="STM32F072VB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F078'  **************************** -->
      <subFamily DsubFamily="STM32F078">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h" define="STM32F072"/>
        <debug svd="SVD\STM32F072x.svd"/>
        <book name="Documents\DM00031936.pdf" title="STM32F078 Series Reference Manual"/>
        <book name="Documents\DM00109263.pdf" title="STM32F078 Data Sheet"/>

        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="4"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="1"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F078CB'  ***************************** -->
        <device Dname="STM32F078CB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32F078RB'  ***************************** -->
        <device Dname="STM32F078RB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="50"/>
        </device>

        <!-- *************************  Device 'STM32F078VB'  ***************************** -->
        <device Dname="STM32F078VB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="86"/>
        </device>
      </subFamily>

      <subFamily DsubFamily="STM32F091">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h" define="STM32F091"/>
        <debug svd="SVD\STM32F072x.svd"/>
        <book name="Documents\DM00031936.pdf" title="STM32F091 Series Reference Manual"/>
        <book name="Documents\DM00115237.pdf" title="STM32F091 Data Sheet"/>

        <feature type="Timer"         n="1"       m="32"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2S"           n="1"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="8"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F091CB'  ***************************** -->
        <device Dname="STM32F091CB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

