jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F0xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32F091CC'  ***************************** -->
        <device Dname="STM32F091CC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F091RB'  ***************************** -->
        <device Dname="STM32F091RB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F091RC'  ***************************** -->
        <device Dname="STM32F091RC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="QFP"           n="48"/>
          <feature type="CSP"           n="49"/>
        </device>

        <!-- *************************  Device 'STM32F091VB'  ***************************** -->
        <device Dname="STM32F091VB">
          <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32F091VC'  ***************************** -->
        <device Dname="STM32F091VC">
          <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\STM32F0xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32F030">
      <description>STMicroelectronics STM32F030 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F030?[468]"/>
    </condition>
    <condition id="STM32F030xC">
      <description>STMicroelectronics STM32F030xC Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F030?C"/>
    </condition>
    <condition id="STM32F031_38">
      <description>STMicroelectronics STM32F031_38 Devices</description>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F031*"/>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F038*"/>
    </condition>
    <condition id="STM32F042_48">
      <description>STMicroelectronics STM32F042_48 Devices</description>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F042*"/>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F048*"/>
    </condition>
    <condition id="STM32F051_58_71">
      <description>STMicroelectronics STM32F051_58_71 Devices</description>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F051*"/>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F058*"/>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F071*"/>
    </condition>
    <condition id="STM32F070x6">
      <description>STMicroelectronics STM32F070x6 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F070?6"/>
    </condition>
    <condition id="STM32F070xB">
      <description>STMicroelectronics STM32F070xB Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F070?B"/>
    </condition>
	<condition id="STM32F072_78">
      <description>STMicroelectronics STM32F072_78 Devices</description>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F072*"/>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F078*"/>
    </condition>
	<condition id="STM32F091">
      <description>STMicroelectronics STM32F091 Devices</description>
      <accept Dvendor="STMicroelectronics:13"  Dname="STM32F091*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32F030 CMSIS">
      <description>STMicroelectronics STM32F030 Devices and CMSIS-Core</description>
      <require condition="STM32F030"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
	 <condition id="STM32F030xC CMSIS">
      <description>STMicroelectronics STM32F030xC Devices and CMSIS-Core</description>
      <require condition="STM32F030xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F031_38 CMSIS">
      <description>STMicroelectronics STM32F031_38 Devices and CMSIS-Core</description>
      <require condition="STM32F031_38"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F042_48 CMSIS">
      <description>STMicroelectronics STM32F042_48 Devices and CMSIS-Core</description>
      <require condition="STM32F042_48"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F051_58_71 CMSIS">
      <description>STMicroelectronics STM32F051_58_71 Devices and CMSIS-Core</description>
      <require condition="STM32F051_58_71"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F072_78 CMSIS">
      <description>STMicroelectronics STM32F072_78 Devices and CMSIS-Core</description>
      <require condition="STM32F072_78"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
	<condition id="STM32F070x6 CMSIS">
      <description>STMicroelectronics STM32F070x6 Devices and CMSIS-Core</description>
      <require condition="STM32F070x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
	<condition id="STM32F070xB CMSIS">
      <description>STMicroelectronics STM32F070xB Devices and CMSIS-Core</description>
      <require condition="STM32F070xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
