jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F0xx_DFP.1.4.0.pdsc
  <condition id="STM32F091 CMSIS">
      <description>STMicroelectronics STM32F091 Devices and CMSIS-Core</description>
      <require condition="STM32F091"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup STM32F030 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F030 CMSIS">
      <description>System Startup for STMicroelectronics STM32F030 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f030.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"      attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"     attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
     </files>
    </component>

    <!-- Startup STM32F030xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F030xC CMSIS">
      <description>System Startup for STMicroelectronics STM32F030xC Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f030xc.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"        attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F031_38 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F031_38 CMSIS">
      <description>System Startup for STMicroelectronics STM32F031_38 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f031.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"      attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"     attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F042_48 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F042_48 CMSIS">
      <description>System Startup for STMicroelectronics STM32F042_48 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f042.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"      attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"     attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F051_58_71 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F051_58_71 CMSIS">
      <description>System Startup for STMicroelectronics STM32F051_58_71 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f051.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"      attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"     attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

	<!-- Startup STM32F070x6 -->
	<component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F070x6 CMSIS">
      <description>System Startup for STMicroelectronics STM32F070x6 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f070x6.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"        attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>
		<!-- Startup STM32F070xB -->
	<component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F070xB CMSIS">
      <description>System Startup for STMicroelectronics STM32F070xB Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f070xb.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"        attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F072_78 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F072_78 CMSIS">
      <description>System Startup for STMicroelectronics STM32F072_78 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f072.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"      attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"     attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32F091 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="STM32F091 CMSIS">
      <description>System Startup for STMicroelectronics STM32F091 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32f091.s" attr="config"   version="1.5.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32f0xx.c"      attr="config"   version="1.5.0"/>
        <!-- Flash Option Bytes template -->
        <file category="sourceAsm" name="Device\Source\ARM\STM32F0xx_OPT.s"     attr="template" version="1.0.0" condition="Compiler ARMCC"  select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- STM32F030-Discovery Board Support -->
    <bundle Cbundle="STM32F030-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F030-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" condition="STM32F030 CMSIS">
      <description>LED driver for STMicroelectronics STM32F030-Discovery Board</description>
        <files>
          <file category="source" name="Boards\ST\STM32F030-Discovery\Common\LED_STM32F030-Discovery.c"/>
        </files>
      </component>
