jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F0xx_DFP.1.4.0.pdsc
      <component Cgroup="Buttons" condition="STM32F030 CMSIS">
      <description>Button driver for STMicroelectronics STM32F030-Discovery Board</description>
        <files>
        <file category="sourceC" name="Boards\ST\STM32F030-Discovery\Common\Buttons_STM32F030-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F051-Discovery Board Support -->
    <bundle Cbundle="STM32F051-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F051-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" condition="STM32F051_58_71 CMSIS">
      <description>LED driver for STMicroelectronics STM32F051-Discovery Board</description>
        <files>
          <file category="source" name="Boards\ST\STM32F051-Discovery\Common\LED_STM32F051-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="STM32F051_58_71 CMSIS">
      <description>Button driver for STMicroelectronics STM32F051-Discovery Board</description>
        <files>
        <file category="sourceC" name="Boards\ST\STM32F051-Discovery\Common\Buttons_STM32F051-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F072-Discovery Board Support -->
    <bundle Cbundle="STM32F072-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F072-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" condition="STM32F072_78 CMSIS">
      <description>LED driver for STMicroelectronics STM32F072-Discovery Board</description>
        <files>
          <file category="source" name="Boards\ST\STM32F072-Discovery\Common\LED_STM32F072-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="STM32F072_78 CMSIS">
      <description>Button driver for STMicroelectronics STM32F072-Discovery Board</description>
        <files>
        <file category="sourceC" name="Boards\ST\STM32F072-Discovery\Common\Buttons_STM32F072-Discovery.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <!-- STM32F030-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32F030-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32F030R8 MCU</description>
      <image small="Boards\ST\STM32F030-Discovery\Documents\STM32F030-Discovery_small.jpg"
             large="Boards\ST\STM32F030-Discovery\Documents\STM32F030-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF259100" title="STM32F030-Discovery Web Page"/>
      <book category="other"     name="Boards\ST\STM32F030-Discovery\Documents\DM00092305.pdf" title="Data Brief"/>
      <book category="schematic" name="Boards\ST\STM32F030-Discovery\Documents\MB1134.pdf"     title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F030R8"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F030"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F031"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F038"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="Accelerometer" n="1"          name="LIS302DL or LIS3DSH ST MEMS 3-axis accelerometer"/>
      <feature type="LED"       n="8"              name="LEDs: USB COM, 3.3 V Power, Two user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32F051-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32F051-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32F051R8 MCU</description>
      <image small="Boards\ST\STM32F051-Discovery\Documents\STM32F051-Discovery_small.jpg"
             large="Boards\ST\STM32F051-Discovery\Documents\STM32F051-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF253215" title="STM32F051-Discovery Web Page"/>
      <book category="other"     name="Boards\ST\STM32F051-Discovery\Documents\DM00050631.pdf" title="Data Brief"/>
      <book category="schematic" name="Boards\ST\STM32F051-Discovery\Documents\MB1034.pdf"     title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F051R8"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F051"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F058"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="2"              name="User, Reset"/>
      <feature type="LED"       n="4"              name="USB COM, 3.3 V Power, 2 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32F072-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32F072-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32F072RB MCU</description>
      <image small="Boards\ST\STM32F072-Discovery\Documents\STM32F072-Discovery_small.jpg"
             large="Boards\ST\STM32F072-Discovery\Documents\STM32F072-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1848/PF259724" title="STM32F072-Discovery Web Page"/>
      <book category="other"     name="Boards\ST\STM32F072-Discovery\Documents\DM00099403.pdf" title="Data Brief"/>
      <book category="schematic" name="Boards\ST\STM32F072-Discovery\Documents\MB1076.pdf"     title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F072RB"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F071"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F072"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F078"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="USB"       n="1"              name="User USB with Mini-B connector"/>
      <feature type="Button"    n="2"              name="User, Reset"/>
      <feature type="Gyro"      n="1"              name="L3GD20, ST MEMS motion sensor, 3-axis digital output gyroscope"/>
      <feature type="Touch"     n="1"              name="Linear Touch Sensor or four Touch Keys"/>
      <feature type="LED"       n="6"              name="USB COM, 3.3 V Power, 4 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
  </boards>


  <examples>
    <!-- STM32F030-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F030-Discovery\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F030-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- STM32F051-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F051-Discovery\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F051-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F051-Discovery\Blinky">
      <description>Blinky example</description>
      <board name="STM32F051-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- STM32F072-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F072-Discovery\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F072-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
